# AreaType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AreaType Property
ParameterTypeId Class See Also
---
"Area Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AreaType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AreaType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AreaType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace